{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "cardiovascular_or_neurologic",
    "1": "gastrointestinal_or_urinary",
    "2": "infection_or_fever",
    "3": "metabolic_or_systemic",
    "4": "musculoskeletal",
    "5": "respiratory_or_immune",
    "6": "skin_or_medication_reaction"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cardiovascular_or_neurologic": 0,
    "gastrointestinal_or_urinary": 1,
    "infection_or_fever": 2,
    "metabolic_or_systemic": 3,
    "musculoskeletal": 4,
    "respiratory_or_immune": 5,
    "skin_or_medication_reaction": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 30522
}
